//! сделать

//С сервера приходят данные о каждом пользователе, а именно: имя/фамилия, дата рождения и зп. Вы должны написать функцию, которая:
//Сравнивает сегодняшнюю дату с датой рождения сотрудника
//Если дата совпадает, выводить ее начальнику по типу “У Василия Иванова сегодня праздник, его премия составляет {...}”
//Начальство придумало следующий алгоритм подсчета премий: к 10% от зп сотрудника прибавляется выражение (день умножить на месяц). В большинстве случаев получаются некрасивые цифры типа 213, 157 итд. Нужно сделать суммы круглыми - 220, 160 итд. Воспроизведите этот алгоритм.
