//=======================================================================
//!===========================   Функции  ===============================
//=======================================================================
//? #1 Обязателен ли "else"?
function checkAge(age) {
  if (age > 18) {
    return true;
  } else {
    // ...
  }
}
console.log(checkAge(14)); // true или undefinet

////? # 2 Перепишите функцию
//вариант 1
const checkAgeExper = (age) => {
  return age > 18 ? true : confirm("Родители разрешили?");
};
console.log(checkAgeExper(11)); // >> confirm

////? # 3 Функция возвращает меньшее из чисел a и b
const min = (a, b) => {
  return a < b ? a : b;
};
console.log(min(-110, 11)); // -110

////? # 4 Функция возвращает x в степени n
const pow = (x, n) => {
  return Number.isInteger(x) && Number.isInteger(n) && x ** n;
};
console.log(pow(3, 3)); //27

//=======================================================================
//!=====================   Функции-стрелки, основы  =====================
//=======================================================================

//////? #5 Замените код Function Expression стрелочной функцией:

function ask(question, yes, no) {
  if (confirm(question)) yes();
  else no();
}
ask(
  "Вы согласны?",
  () => alert("Вы согласились."),
  () => alert("Вы отменили выполнение.")
);
